app/Controllers/SubmitEdit.php

UPDATE `dosen` SET `user_id` = '1', `nama` = 'Astri Mutiar', `nidn_nidk` = '0415049106', `klaster` = 'Kelompok Perguruan Tinggi Binaan', `institusi` = 'Sekolah Tinggi Ilmu Keperawtan PPNI Jawa Barat', `program_studi` = 'Ilmu Keperawatan', `pendidikan` = 'S2', `jabatan` = 'Asisten Ahli', `alamat` = 'jl talaga bodas no 144 BRP', `tempat_lahir` = 'Ciamis', `tanggal_lahir` = '15 April 1991', `ktp` = '3207315504910001', `telp` = '', `hp` = '085351700634', `website` = '', `updated_at` = '2024-11-03 15:19:38'
WHERE `dosen`.`id` IN ('1')
UPDATE `dosen_profile` SET `dosen_id` = '1', `penelitian` = '2', `pengabdian` = '1', `artikel_internasional` = '6', `hki` = '10', `buku` = '2', `updated_at` = '2024-11-03 15:19:39'
WHERE `dosen_profile`.`id` IN ('1')
UPDATE `sinta` SET `dosen_id` = '1', `sinta_id` = '6698251', `overall` = '303', `3_year` = '0', `updated_at` = '2024-11-03 15:19:39'
WHERE `sinta`.`id` IN ('1')
UPDATE `scopus` SET `dosen_id` = '1', `scopus_id` = '', `h_index` = '4', `articles` = '2', `citation` = '6', `updated_at` = '2024-11-03 15:19:39'
WHERE `scopus`.`id` IN ('1')
---
    public function dosen($id)
    {
        $user_id = user_id();

        //dd($this->dosenModel->addDosenID($user_id))

        $this->dosenModel->save([
            'id' => $id,
            'user_id' => $user_id,
            'nama' => $this->request->getVar('namaUser'),
            'nidn_nidk' => $this->request->getVar('nidn'),
            'klaster' => $this->request->getVar('klaster'),
            'institusi' => $this->request->getVar('institusi'),
            'program_studi' => $this->request->getVar('programStudi'),
            'pendidikan' => $this->request->getVar('jenjangPendidikan'),
            'jabatan' => $this->request->getVar('jabatanAkademik'),
            'alamat' => $this->request->getVar('alamat'),
            'tempat_lahir' => $this->request->getVar('tempatLahir'),
            'tanggal_lahir' => $this->request->getVar('tanggalLahir'),
            'ktp' => $this->request->getVar('noKTP'),
            'telp' => $this->request->getVar('noTelp'),
            'hp' => $this->request->getVar('noHP'),
            'website' => $this->request->getVar('website')
        ]);

        $this->dosenProfileModel->save([
            'id' => $this->dosenProfileModel->profileID($id),
            'dosen_id' => $user_id,
            'penelitian' =>  $this->request->getVar('penelitian'),
            'pengabdian' =>  $this->request->getVar('pengabdian'),
            'artikel_internasional' =>  $this->request->getVar('artikel'),
            'hki' =>  $this->request->getVar('HKI'),
            'buku' =>  $this->request->getVar('buku'),
        ]);

        $this->sintaModel->save([
            'id' => $this->sintaModel->sintaID($id),
            'dosen_id' => $user_id,
            'sinta_id' =>  $this->request->getVar('sintaIndex'),
            'overall' =>  $this->request->getVar('sintaOverall'),
            '3_year' =>  $this->request->getVar('sinta3yr'),
        ]);

        $this->scopusModel->save([
            'id' => $this->scopusModel->scopusID($id),
            'dosen_id' => $user_id,
            'scopus_id' =>  $this->request->getVar('scopusIndex'),
            'h_index' =>  $this->request->getVar('scopusHIndex'),
            'articles' =>  $this->request->getVar('jumlahArtikel'),
            'citation' =>  $this->request->getVar('citation'),
        ]);