app/Models/DosenProfileMDL.php

SELECT *
FROM `dosen_profile`
WHERE `dosen_id` = '1'
---
    public function profileID($id){
        $this->where(['dosen_id' => $id]);
        $query = $this->findAll();