app/Models/UserMDL.php

UPDATE `users` SET `dosen_id` = '1', `updated_at` = '2024-11-03 15:19:39'
---
    public function addDosenID($id,$val=null){
        $val=$id;
        $this->where(['id' => $id]);
        $query = $this->findAll();
        foreach ($query as $q) {
            $q['dosen_id']=$val;
            $this->set('dosen_id', $val);
            $this->update();